app/controllers/events_controller.rb

    def index
      @events = Events.all
---
SELECT "events".* FROM "events"

    def create
      @events = Events.new(events_params)

      respond_to do |format|
        if @events.save
---
INSERT INTO "events" ("event_link", "event_name", "event_datetime", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def destroy
      @events.destroy
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]

      def set_events
        @events = Events.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]