app/controllers/meetings_controller.rb

  def create
    @meeting = Meeting.new(meeting_params)

    respond_to do |format|
      if @meeting.save
---
INSERT INTO "meetings" ("name", "date", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test"], ["date", "2024-02-29"], ["location", "ZACH"], ["created_at", "2024-03-01 04:23:12.860181"], ["updated_at", "2024-03-01 04:23:12.860181"]]

  def update
    respond_to do |format|
      if @meeting.update(meeting_params)
---
UPDATE "meetings" SET "location" = ?, "updated_at" = ? WHERE "meetings"."id" = ?  [["location", "Blocker"], ["updated_at", "2024-02-27 04:02:07.794160"], ["id", 2]]

  def destroy
    @meeting.destroy
---
DELETE FROM "meetings" WHERE "meetings"."id" = ?  [["id", 1]]