app/controllers/meetings_members_controller.rb

SELECT "meetings_members".* FROM "meetings_members"
---
    def index
      @meetings_members = MeetingsMember.includes(:meeting, :member).all