app/controllers/members_controller.rb

  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("member_name", "member_points", "executive_status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["member_name", "Alex"], ["member_points", 2], ["executive_status", 1], ["created_at", "2024-02-27 03:49:43.518833"], ["updated_at", "2024-02-27 03:49:43.518833"]]